rubystuff/app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @restaurants = Restaurant.find(params[:id])

INSERT INTO "restaurants" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-03-01 20:34:35.572634"], ["updated_at", "2016-03-01 20:34:35.572634"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 2]]
---
  def destroy
    @restaurant.destroy

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:id])